БухЭксп/Documents/CW_УслугиПоДоговоруГрузоперевозки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_УслугиПоДоговоруГрузоперевозки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.CW_УслугиПоДоговоруГрузоперевозки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НоменклатураПоДоговору</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Груз</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Грузы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокОтражения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияДоходов</v8:Type>
								<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантРасчетаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыРасчетаНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокОтраженияЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокОтраженияЗатрат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перевыставление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеревыставлениеПоСтавкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокОтраженияДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокОтраженияДоходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перевыставление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобственнаяУслуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеревыставлениеПоСтавкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеДоходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Documents/CW_УслугиПоДоговоруГрузоперевозки/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура НоменклатураПоДоговоруЦенаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.НоменклатураПоДоговору.ТекущаяСтрока;
	
	РассчитатьСтрокуНаСервере(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПоДоговоруСтавкаНДСПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.НоменклатураПоДоговору.ТекущаяСтрока;
	
	РассчитатьСтрокуНаСервере(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПоДоговоруНДСПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.НоменклатураПоДоговору.ТекущаяСтрока;
	
	РассчитатьСтрокуНаСервере(ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСтрокуНаСервере(ТекущаяСтрока)
	
	тСтрока = Объект.НоменклатураПоДоговору.НайтиПоИдентификатору(ТекущаяСтрока);
	
	Если тСтрока <> Неопределено Тогда
		
		Если тСтрока.ВариантРасчетаНДС = Перечисления.ВариантыРасчетаНДС.ДокументБезНДС или тСтрока.ВариантРасчетаНДС = Перечисления.ВариантыРасчетаНДС.НДССверху Тогда
			тСтрока.ЦенаБезНДС = тСтрока.Цена;	
		ИначеЕсли тСтрока.ВариантРасчетаНДС = Перечисления.ВариантыРасчетаНДС.НДСВСумме Тогда
			
			ЦенаСНДС =  тСтрока.Цена;
			
			СтавкаНДС = CW_Финансы.ПолучитьСтавкуНДС(тСтрока.СтавкаНДС);
			СуммаНДС 	= ЦенаСНДС*СтавкаНДС/100;
			
			тСтрока.ЦенаБезНДС = ЦенаСНДС - СуммаНДС;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановкаЦенНоменклатурыВЗависимостиОтКлиента 	= ПолучитьФункциональнуюОпцию("CW_УстановкаЦенНоменклатурыВЗависимостиОтКлиента");
	ИспользованиеСхемыПеревыставленияПоСтавкам 		= ПолучитьФункциональнуюОпцию("CW_ИспользованиеСхемыПеревыставленияПоСтавкам");
	
	ВариантРасчетаНДС = Константы.CW_ОсновнойВариантУстановкиЦенПоДоговорам.Получить();
	
	ДатаСреза = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата());
	
	Если Объект.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком тогда
		
		СтруктураПараметров = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
		СтруктураПараметров.Дата 				= ДатаСреза;
		СтруктураПараметров.Договор 			= Объект.Договор;
		
		ПараметрыДоговора	= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметров, "ОсновнойПорядокОтраженияРасходов");
		
		ОсновнойПорядокОтражения = ПараметрыДоговора.ОсновнойПорядокОтраженияРасходов;
		
		Элементы.НоменклатураПоДоговоруПорядокОтражения.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияЗатрат.Перевыставление);
		Элементы.НоменклатураПоДоговоруПорядокОтражения.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияЗатрат.Затраты);
		
		Если ИспользованиеСхемыПеревыставленияПоСтавкам Тогда
			Элементы.НоменклатураПоДоговоруПорядокОтражения.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияЗатрат.ПеревыставлениеПоСтавкам);
		КонецЕсли;	
		
		Элементы.НоменклатураПоДоговоруПорядокОтражения.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияЗатрат.ПрочиеРасходы);
		
	ИначеЕсли  Объект.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем тогда
		
		СтруктураПараметров = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
		СтруктураПараметров.Дата 				= ДатаСреза;
		СтруктураПараметров.Договор 			= Объект.Договор;
		
		ПараметрыДоговора	= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметров, "ОсновнойПорядокОтраженияДоходов");
		
		ОсновнойПорядокОтражения = ПараметрыДоговора.ОсновнойПорядокОтраженияДоходов;
		
		Элементы.НоменклатураПоДоговоруПорядокОтражения.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияДоходов.Перевыставление);
		Элементы.НоменклатураПоДоговоруПорядокОтражения.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияДоходов.СобственнаяУслуга);
		
		Если ИспользованиеСхемыПеревыставленияПоСтавкам Тогда
			Элементы.НоменклатураПоДоговоруПорядокОтражения.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам);
		КонецЕсли;		
	КонецЕсли;
	
	РазрешеноРедактироватьУслугиПоДоговорам = Истина;                                 
	//Проверяем только два вида договора
	Если Объект.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
		РазрешеноРедактироватьУслугиПоДоговорам = CW_ПраваДоступа.ПравоДоступно("РедактироватьУслугиПоВходящимДоговорам");
	ИначеЕсли  Объект.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
		РазрешеноРедактироватьУслугиПоДоговорам = CW_ПраваДоступа.ПравоДоступно("РедактироватьУслугиПоИсходящимДоговорам");
	Конецесли;
	
	ТолькоПросмотр = НЕ РазрешеноРедактироватьУслугиПоДоговорам;
	
	Элементы.НоменклатураПоДоговоруКлиент.Видимость = УстановкаЦенНоменклатурыВЗависимостиОтКлиента и Объект.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
	
	Элементы.НоменклатураПоДоговоруПорядокОтражения.ПодсказкаВвода = СокрЛП(ОсновнойПорядокОтражения);
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеОтбора = новый Структура("Услуга", истина);
	
	ПараметрыФормы = новый Структура;
	ПараметрыФормы.Вставить("Отбор", 				ДанныеОтбора);
	ПараметрыФормы.Вставить("МножественныйВыбор", 	истина);
	
	ОписаниеОповещения = новый ОписаниеОповещения("ОбработкаПодбораНоменклатуры",ЭтаФорма);
	
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПодбораНоменклатуры(РезультатВыбора, Параметры) Экспорт
	
	Если РезультатВыбора <> Неопределено Тогда
		
		ОбрабтатьПодборНаСервере(РезультатВыбора);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбрабтатьПодборНаСервере(РезультатВыбора)
	
	Для Каждого ЭлементВыбора из РезультатВыбора Цикл
		
		ДанныеОтбора = Новый Структура("Номенклатура", ЭлементВыбора);
		
		мСтроки =  Объект.НоменклатураПоДоговору.НайтиСтроки(ДанныеОтбора);
		
		Если мСтроки.Количество() = 0 Тогда
			НоваяСтрока = Объект.НоменклатураПоДоговору.Добавить();
			НоваяСтрока.Номенклатура 		= ЭлементВыбора;
			НоваяСтрока.СтавкаНДС 			= Справочники.Номенклатура.СтавкаНДС(ЭлементВыбора, Объект.Дата);
			НоваяСтрока.ВариантРасчетаНДС 	= ВариантРасчетаНДС;
			НоваяСтрока.Валюта 				= Объект.Договор.ВалютаДоговора;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПроверитьДублиСтрок(Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьДублиСтрок(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НоменклатураПоДоговору.Номенклатура КАК Номенклатура,
	               |	НоменклатураПоДоговору.Груз КАК Груз,
	               |	НоменклатураПоДоговору.Клиент КАК Клиент,
	               |	НоменклатураПоДоговору.НомерСтроки КАК НомерСтроки
	               |ПОМЕСТИТЬ ВТ_ВнешниеДанные
	               |ИЗ
	               |	&НоменклатураПоДоговору КАК НоменклатураПоДоговору
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ВнешниеДанные.НомерСтроки) КАК НомерСтроки,
	               |	ВТ_ВнешниеДанные.Номенклатура КАК Номенклатура,
	               |	ВТ_ВнешниеДанные.Груз КАК Груз,
	               |	ВТ_ВнешниеДанные.Клиент КАК Клиент
	               |ПОМЕСТИТЬ ВТ_Свернуто
	               |ИЗ
	               |	ВТ_ВнешниеДанные КАК ВТ_ВнешниеДанные
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ВнешниеДанные.Номенклатура,
	               |	ВТ_ВнешниеДанные.Груз,
	               |	ВТ_ВнешниеДанные.Клиент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Свернуто.Номенклатура КАК Номенклатура,
	               |	ВТ_Свернуто.Груз КАК Груз,
	               |	ВТ_Свернуто.Клиент КАК Клиент,
	               |	ВТ_Свернуто.НомерСтроки КАК НомерСтроки
	               |ИЗ
	               |	ВТ_Свернуто КАК ВТ_Свернуто
	               |ГДЕ
	               |	ВТ_Свернуто.НомерСтроки > 1";
	
	ВремТЗ = Объект.НоменклатураПоДоговору.Выгрузить();
	
	Запрос.УстановитьПараметр("НоменклатураПоДоговору", ВремТЗ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() Тогда
		
		Отказ = истина;
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Дублирование строки: "+Строка(Выборка.Номенклатура)+", груз: "+?(ЗначениеЗаполнено(Выборка.Груз),Строка(Выборка.Груз),"<Не указан>")+", клиент: "+?(ЗначениеЗаполнено(Выборка.клиент),Строка(Выборка.клиент),"<Не указан>");
			Сообщение.Сообщить();
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииНоменклатурыНаСервере(ТекущаяСтрока)
	
	СтрокаДокумента = Объект.НоменклатураПоДоговору.НайтиПоИдентификатору(ТекущаяСтрока);
	
	Если Объект.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
		ТипДвижения = "ДОХОДЫ";
	ИначеЕсли Объект.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
		ТипДвижения = "РАСХОДЫ";
	КонецЕсли;   
	
	ПодставлятьСтавкуНДС = CW_Настройки.ПолучитьНастройкуПользователя(ПараметрыСеанса.ТекущийПользователь, "ПодставлятьСтавкуНДС");
	Если ПодставлятьСтавкуНДС или Не ЗначениеЗаполнено(СтрокаДокумента.СтавкаНДС) Тогда   
		ПараметрыСтавкиНДС = Новый Структура;
		ПараметрыСтавкиНДС.Вставить("Дата", 		Объект.Дата);
		ПараметрыСтавкиНДС.Вставить("Организация", 	Объект.Договор.Организация); 
		ПараметрыСтавкиНДС.Вставить("Номенклатура", СтрокаДокумента.Номенклатура);
		ПараметрыСтавкиНДС.Вставить("Договор", 		Объект.Договор);   
		ПараметрыСтавкиНДС.Вставить("ПодставлятьСтавкуНДС",  CW_Настройки.ПолучитьНастройкуПользователя(ПараметрыСеанса.ТекущийПользователь,"ПодставлятьСтавкуНДС"));
		ПараметрыСтавкиНДС.Вставить("ТипДвижения",  ТипДвижения);
		
		СтрокаДокумента.СтавкаНДС = CW_Документы.ПолучитьСтавкуНДС(ПараметрыСтавкиНДС);
	КонецЕсли;
	
	СтрокаДокумента.ВариантРасчетаНДС 	= ВариантРасчетаНДС;
	СтрокаДокумента.ПорядокОтражения 	= ОсновнойПорядокОтражения;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПоДоговоруНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.НоменклатураПоДоговору.ТекущаяСтрока;
	
	ПриИзмененииНоменклатурыНаСервере(ТекущаяСтрока)

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("ОбновитьСписокУслугПоПротоколу");
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыполнитьМетодВладельца" Тогда
			
		Если ТипЗнч(Параметр) = тип("Структура") Тогда
			УникальныйИдентификаторВладельца 	= Неопределено;
			МетодыФормыВладельца 				= Неопределено;
			
			Параметр.Свойство("УникальныйИдентификатор"	, УникальныйИдентификаторВладельца);
			Параметр.Свойство("МетодыФормыВладельца"	, МетодыФормыВладельца);
			
			Если ЭтаФорма.УникальныйИдентификатор = УникальныйИдентификаторВладельца Тогда
				Если Не МетодыФормыВладельца = Неопределено и ТипЗнч(МетодыФормыВладельца) = Тип("Массив") Тогда
					
					Для Каждого СтрокаМассива из МетодыФормыВладельца Цикл
						Попытка
							Выполнить(СтрокаМассива);
						Исключение
						КонецПопытки;
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	//Подсистема.РаботаСПодключаемымиОбъектами
	CW_ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);
	//Подсистема.РаботаСПодключаемымиОбъектами
	
	Оповестить("ОбновитьАдресУслугДоговора");
КонецПроцедуры

 &НаКлиенте
Процедура НоменклатураПоДоговоруПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока и Не Копирование Тогда
		ТекущиеДанные = Элементы.НоменклатураПоДоговору.ТекущиеДанные;	
		ТекущиеДанные.Валюта = Объект.ВалютаДокумента;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда) 
	
	ДополнительныеПараметры = Новый Структура;
	Оповещение = Новый ОписаниеОповещения("ПередНачаломЗаполненияТабличнойЧасти", ЭтотОбъект, ДополнительныеПараметры);
	
	Если Объект.НоменклатураПоДоговору.Количество() > 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, "Табличная часть документа будет очищена. Продолжить?", Режим, 0);
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры     

&НаКлиенте
Процедура ПередНачаломЗаполненияТабличнойЧасти(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	ПараметрыВыбораПротокола = Новый Структура;
	ПараметрыВыбораПротокола.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыВыбораПротокола.Вставить("МножественныйВыбор", Ложь);

	ОписаниеОповещения = новый ОписаниеОповещения("ПослеВыбораПротоколаЦен",ЭтаФорма);
	
	ОткрытьФорму("Документ.CW_УслугиПоДоговоруГрузоперевозки.ФормаВыбора", ПараметрыВыбораПротокола, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПротоколаЦен(РезультатВыбора, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьВыборПротоколаЦен(РезультатВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборПротоколаЦен(ВыбранноеЗначение) 
	
	ТаблицаПротокола = ВыбранноеЗначение.НоменклатураПоДоговору.Выгрузить(); 
	Объект.НоменклатураПоДоговору.Загрузить(ТаблицаПротокола);
	
КонецПроцедуры


#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры


#КонецОбласти
